package app;

public class Main {
    public static void main(String[] args) {

/* Задание 1
Создайте новый модуль. В модуле создайте package c названием app.
Создайте новый класс. Создайте метод main.
Исходные данные: Цена за один билет в кино составляет 4 у.е. У вас 19 у.е.
 Напишите программу, которая сохраняет эти данные в переменных,
 вычисляет и выводит в консоль, сколько билетов вы можете купить.
 Сколько денег у вас останется, после покупки максимально возможного количества билетов.
 */
        int ticket = 4;
        int myAmount = 19;

        int res = myAmount / ticket;
        int moneyLeft = myAmount % ticket;

        System.out.println("У вас на счету " + myAmount + " Евро." + " Цена билета " + ticket);
        System.out.println("Вы можете купить: " + res + " билета.");
        System.out.println("После покупки билетов у вас осталось " + moneyLeft + " Евро");

        System.out.println("=======================================================");

        /*
        Создайте новый класс. Создайте метод main. Объявите 2 переменные:

цена товара без налога;
налог
Напишите программу, которая вычисляет цену товара с налогом

Например, так:

Введите цену товара: 200.0
Налон составит: 19
Цена с налогом 238.0
         */
        double price = 200;
        double tax = 19;

        double taxAmount = price * (tax / 100);
        double priceWithTaxes = price + taxAmount;
        System.out.println("Цена с налогом на товар составит: " + priceWithTaxes);

    }
}
